uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СтруктураОперативногоПланирования/СтруктураОперативногоПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтруктураОперативногоПланирования</name>
  <resources>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>CatalogRef.АналитикиОперативногоПланирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ИспользованиеАналитик/ИспользованиеАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИспользованиеАналитик</name>
  <enumValues>
    <name>КлючеваяАналитика</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Колонка</name>
  </enumValues>
  <enumValues>
    <name>Уточняется</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВидыОперативныхПланов/ВидыОперативныхПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОперативныхПланов</name>
  <predefined>
    <items>
      <name>БюджетБДР</name>
      <description>Бюджет БДР</description>
    </items>
    <items>
      <name>БюджетДДС</name>
      <description>Бюджет ДДС</description>
    </items>
    <items>
      <name>БюджетЗакупок</name>
      <description>Бюджет закупок</description>
    </items>
    <items>
      <name>КонсолидированныйПланПотребностей</name>
      <description>Консолидированный план потребностей</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРазрядность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПослеЗапятой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоРазрядность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоПослеЗапятой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРазрядностьВвод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПослеЗапятойВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоРазрядностьВвод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоПослеЗапятойВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьДляВидаОпераций</name>
    <type>
      <types>EnumRef.ВидыОперацийОперативныйПлан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГоризонта</name>
    <type>
      <types>EnumRef.ВидыГоризонтовПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйПериод</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперативногоПланаБДР</name>
    <type>
      <types>CatalogRef.ВидыОперативныхПланов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкаАналитик</name>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>CatalogRef.АналитикиОперативногоПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>EnumRef.ИспользованиеАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАналитики</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаСтрок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольЛимитов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/АналитикиОперативногоПланирования/АналитикиОперативногоПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикиОперативногоПланирования</name>
  <predefined>
    <items>
      <name>Аналитика1</name>
      <description>Аналитика1</description>
    </items>
    <items>
      <name>Аналитика2</name>
      <description>Аналитика2</description>
    </items>
    <items>
      <name>Аналитика3</name>
      <description>Аналитика3</description>
    </items>
    <items>
      <name>Аналитика4</name>
      <description>Аналитика4</description>
    </items>
    <items>
      <name>Аналитика5</name>
      <description>Аналитика5</description>
    </items>
    <items>
      <name>Аналитика6</name>
      <description>Аналитика6</description>
    </items>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
    </items>
    <items>
      <name>ВидБюджета</name>
      <description>Вид бюджета</description>
    </items>
    <items>
      <name>ДоговорКонтрагента</name>
      <description>Договор контрагента</description>
    </items>
    <items>
      <name>ДокументПланирования</name>
      <description>Документ планирования</description>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
    </items>
    <items>
      <name>Менеджер</name>
      <description>Менеджер</description>
    </items>
    <items>
      <name>МестоПоставки</name>
      <description>Место поставки</description>
    </items>
    <items>
      <name>ПриходРасход</name>
      <description>Направление операции</description>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>Организация</name>
      <description>Организация</description>
    </items>
    <items>
      <name>Период</name>
      <description>Период</description>
    </items>
    <items>
      <name>Приоритет</name>
      <description>Приоритет</description>
    </items>
    <items>
      <name>Проект</name>
      <description>Проект</description>
    </items>
    <items>
      <name>СтатьяБюджета</name>
      <description>Статья бюджета</description>
    </items>
    <items>
      <name>Характеристика</name>
      <description>Характеристика</description>
    </items>
    <items>
      <name>ЦФО</name>
      <description>ЦФО</description>
    </items>
  </predefined>
  <attributes>
    <name>ВозможноЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ГруппыСтатейБюджета</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролироватьНаправление</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/ОбработчикиОбновленияУХОП/Module.bsl
// Обработчики, для объектов ОперативногоПланирования и лимитирования, вне зависимости от мастер-системы
//
#Область ПрограммныйИнтерфейс

///////// 3.0 ////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 2.0.0.12/ПЕРВ Выполняет первоначальное заполнение справочника ВидыОперативныхПланов
Процедура ВыполнитьПервоначальноеЗаполнениеВидовОперативныхПланов() экспорт
	Справочники.ВидыОперативныхПланов.ПервоначальноеЗаполнение();
КонецПроцедуры

// 3.1.0.1/ПЕРВ первоначальное заполнение РегистрСведений.ПараметрыОперативногоПланирования
Процедура ВыполнитьПервоначальноеЗаполнениеПараметровОперативногоПланирования() Экспорт
	РегистрыСведений.УдалитьПараметрыОперативногоПланирования.ПервоначальноеЗаполнение();
КонецПроцедуры // ЗаполнитьПараметрыОперативногоПланированияПоУмолчанию() 

// 3.1.0.1/ПЕРВ первоначальное заполнение РегистрСведений.ПараметрыЛимитирования
Процедура ВыполнитьПервоначальноеЗаполнениеПараметровЛимитирования() Экспорт
	РегистрыСведений.ПараметрыЛимитирования.ПервоначальноеЗаполнение();
КонецПроцедуры // ВыполнитьПервоначальноеЗаполнениеПараметровЛимитирования() 

// 3.0.1.61/КОРР Устанавливается признак использования для аналитик Контрагент и Договор
Процедура ДобавитьВКлючевыеАналитикиКонтрагентИДоговор() экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыОперативныхПлановНастройкаАналитик.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОперативныхПланов.НастройкаАналитик КАК ВидыОперативныхПлановНастройкаАналитик
	|ГДЕ
	|	(ВидыОперативныхПлановНастройкаАналитик.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыОперативныхПланов.БюджетДДС)
	|			ИЛИ ВидыОперативныхПлановНастройкаАналитик.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыОперативныхПланов.БюджетБДР))
	|	И (ВидыОперативныхПлановНастройкаАналитик.Аналитика = ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Контрагент)
	|			ИЛИ ВидыОперативныхПлановНастройкаАналитик.Аналитика = ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.ДоговорКонтрагента))
	|	И ВидыОперативныхПлановНастройкаАналитик.Использование <> ЗНАЧЕНИЕ(Перечисление.ИспользованиеАналитик.КлючеваяАналитика)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Спр = Выборка.Ссылка.ПолучитьОбъект();
			
			Для каждого Стр Из Спр.НастройкаАналитик Цикл
				
				Если Стр.Аналитика = Справочники.АналитикиОперативногоПланирования.Контрагент
					ИЛИ Стр.Аналитика = Справочники.АналитикиОперативногоПланирования.ДоговорКонтрагента Тогда
				
					Стр.Использование = Перечисления.ИспользованиеАналитик.КлючеваяАналитика;
				
				КонецЕсли; 
			
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Спр);
		
		КонецЦикла; 
	КонецЕсли;
	
	// Документы
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОперативныйПланНастройкаАналитик.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперативныйПлан.НастройкаАналитик КАК ОперативныйПланНастройкаАналитик
	|ГДЕ
	|	(ОперативныйПланНастройкаАналитик.Ссылка.ВидОперативногоПлана = ЗНАЧЕНИЕ(Справочник.ВидыОперативныхПланов.БюджетДДС)
	|			ИЛИ ОперативныйПланНастройкаАналитик.Ссылка.ВидОперативногоПлана = ЗНАЧЕНИЕ(Справочник.ВидыОперативныхПланов.БюджетБДР))
	|	И (ОперативныйПланНастройкаАналитик.Аналитика = ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Контрагент)
	|			ИЛИ ОперативныйПланНастройкаАналитик.Аналитика = ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.ДоговорКонтрагента))
	|	И ОперативныйПланНастройкаАналитик.Использование <> ЗНАЧЕНИЕ(Перечисление.ИспользованиеАналитик.КлючеваяАналитика)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Док = Выборка.Ссылка.ПолучитьОбъект();
			
			Для каждого Стр Из Док.НастройкаАналитик Цикл
				
				Если Стр.Аналитика = Справочники.АналитикиОперативногоПланирования.Контрагент
					ИЛИ Стр.Аналитика = Справочники.АналитикиОперативногоПланирования.ДоговорКонтрагента Тогда
				
					Стр.Использование = Перечисления.ИспользованиеАналитик.КлючеваяАналитика;
				
				КонецЕсли; 
			
			КонецЦикла;
			
			Док.ОбменДанными.Загрузка = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Док,,,РежимЗаписиДокумента.Запись);
		
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

// 3.0.1.70/КОРР удаляет аналитику ДокПланирования из настроек видов опер.планов и документов Оперативный план.
Процедура УдалитьАналитикуДокументПланирования() экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыОперативныхПлановНастройкаАналитик.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОперативныхПланов.НастройкаАналитик КАК ВидыОперативныхПлановНастройкаАналитик
	|ГДЕ
	|	ВидыОперативныхПлановНастройкаАналитик.Аналитика = ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.ДокументПланирования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОперативныйПланНастройкаАналитик.Ссылка
	|ИЗ
	|	Документ.ОперативныйПлан.НастройкаАналитик КАК ОперативныйПланНастройкаАналитик
	|ГДЕ
	|	ОперативныйПланНастройкаАналитик.Аналитика = ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.ДокументПланирования)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	АналитикаКУдалению = Справочники.АналитикиОперативногоПланирования.ДокументПланирования;
	
	//
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Поз = 0;
		Пока Поз< Объект.НастройкаАналитик.Количество() Цикл
			
			Строка = Объект.НастройкаАналитик[Поз];
			Если Строка.Аналитика = АналитикаКУдалению Тогда
				Объект.НастройкаАналитик.Удалить(Строка);
			Иначе
				Поз = Поз + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	
	КонецЦикла; 
	
КонецПроцедуры

// 3.1.0.27/ПЕРВ устанавливает аналитикам оперативного планирования связь с пвх.ВидыСубконтоКорпоративные
Процедура ЗаполнитьТипДанныхАналитикиОП() Экспорт
	
	//
	Спр = Справочники.АналитикиОперативногоПланирования.Аналитика1.ПолучитьОбъект();
	Спр.ТипДанных = ПолучитьВидСубконтоПоАналитике(Справочники.АналитикиОперативногоПланирования.Аналитика1);
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Спр);
	
	//
	Спр = Справочники.АналитикиОперативногоПланирования.Аналитика2.ПолучитьОбъект();
	Спр.ТипДанных = ПолучитьВидСубконтоПоАналитике(Справочники.АналитикиОперативногоПланирования.Аналитика2);
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Спр);
	
	//
	Спр = Справочники.АналитикиОперативногоПланирования.Аналитика3.ПолучитьОбъект();
	Спр.ТипДанных = ПолучитьВидСубконтоПоАналитике(Справочники.АналитикиОперативногоПланирования.Аналитика3);
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Спр);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикиОперативногоПланирования.Ссылка КАК Аналитика,
	|	АналитикиОперативногоПланирования.ТипДанных КАК ТипДанных
	|ИЗ
	|	Справочник.АналитикиОперативногоПланирования КАК АналитикиОперативногоПланирования
	|ГДЕ
	|	АналитикиОперативногоПланирования.Предопределенный = ИСТИНА
	|	И АналитикиОперативногоПланирования.ТипДанных = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|	И АналитикиОперативногоПланирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика1)
	|	И АналитикиОперативногоПланирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика2)
	|	И АналитикиОперативногоПланирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика3)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	//
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВидСубконто = ПолучитьВидСубконтоПоАналитике(Выборка.Аналитика);
		Если НЕ ЗначениеЗаполнено(ВидСубконто) Тогда
			Продолжить;
		КонецЕсли;
		
		//
		Спр = Выборка.Аналитика.ПолучитьОбъект();
		Спр.ТипДанных = ВидСубконто;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Спр);
		
	КонецЦикла;
	
КонецПроцедуры

// 3.1.0.27/ПЕРВ Заполняет признак возможности лимитирования по аналитике
Процедура ЗаполнитьПризнакВозможностиЛимитирования() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикиОперативногоПланирования.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АналитикиОперативногоПланирования КАК АналитикиОперативногоПланирования
	|ГДЕ
	|	АналитикиОперативногоПланирования.Предопределенный = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// При записи объекта устанавливается признак Возможности лимитирования
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Выборка.Ссылка.ПолучитьОбъект());
	КонецЦикла; 
	
КонецПроцедуры

// 3.1.0.27/ПЕРВ Выполняет первоначальное заполнение РегистрСведений.СтруктураОперативногоПланирования
Процедура ЗаполнитьСтруктуруОперативногоПланированияПоУмолчанию() Экспорт
	
	Аналитики = Справочники.АналитикиОперативногоПланирования;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств) КАК ВидБюджета,
	|	ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств) КАК Предназначение
	|ПОМЕСТИТЬ ВТ_ВидыБюджетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов),
	|	ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидыБюджетов.ВидБюджета КАК ВидБюджета,
	|	ВТ_ВидыБюджетов.Предназначение КАК Предназначение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтруктураОперативногоПланирования.Аналитика) КАК КолвоАналитик
	|ИЗ
	|	ВТ_ВидыБюджетов КАК ВТ_ВидыБюджетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураОперативногоПланирования КАК СтруктураОперативногоПланирования
	|		ПО ВТ_ВидыБюджетов.ВидБюджета = СтруктураОперативногоПланирования.ВидБюджета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВидыБюджетов.ВидБюджета,
	|	ВТ_ВидыБюджетов.Предназначение";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КолвоАналитик > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//
		НЗ = РегистрыСведений.СтруктураОперативногоПланирования.СоздатьНаборЗаписей();
		
		Отбор = НЗ.Отбор.Предназначение;
		Отбор.ВидСравнения = ВидСравнения.Равно;
		Отбор.Значение = Выборка.Предназначение;
		Отбор.Использование = Истина;
		
		НЗ.Прочитать();
		НЗ.Очистить();
		
		// Заполняем структуру бюджета
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.ВидБюджета,			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Период,				Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Валюта,				Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.ЦФО, 					Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Проект, 				Ложь,	Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.СтатьяБюджета,		Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Аналитика1,			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Аналитика2, 			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Аналитика3, 			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Аналитика4, 			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Аналитика5, 			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Аналитика6, 			Истина, Истина);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.Контрагент,			Ложь,	Ложь);
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.ДоговорКонтрагента,	Ложь,	Ложь);
		
		ДобавитьВСтруктуруАналитику(НЗ,	Аналитики.ПриходРасход,		Истина,	Ложь);
		
		Для Каждого Строка Из НЗ Цикл
			Строка.ВидБюджета = Выборка.ВидБюджета;
			Строка.Предназначение = Выборка.Предназначение;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НЗ, Истина);
			
	КонецЦикла;
	
КонецПроцедуры

// 3.1.0.111/КОРР. расширяет аналитики статей  до 6-ти в оперативном планировании
Процедура ОбновитьОперативноеПланированиеДо6Аналитик() Экспорт
	
	ИнициализироватьАналитики456ОперПланирования();
	ОбновитьСтруктуруОперативногоПланированияДо6АналитикСтатьи();
	ДобавитьАналитики456СтатьиВОперативныеПланы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УстановкаСвязиАналитикиСПВХКорп

Функция ПолучитьВидСубконтоПоАналитике(Аналитика)
	
	Аналитики = Справочники.АналитикиОперативногоПланирования;
	ПВХКорп = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные;
	
	Если Аналитика = Аналитики.Аналитика1 Тогда
		Возврат ПВХКорп.ПустаяСсылка();
	ИначеЕсли Аналитика = Аналитики.Аналитика2 Тогда
		Возврат ПВХКорп.ПустаяСсылка();
	ИначеЕсли Аналитика = Аналитики.Аналитика3 Тогда
		Возврат ПВХКорп.ПустаяСсылка();
	ИначеЕсли Аналитика = Аналитики.Валюта Тогда
		Возврат ПВХКорп.СправочникВалюты;
	ИначеЕсли Аналитика = Аналитики.ВидБюджета Тогда
		
		ОТ = Новый ОписаниеТипов("ПеречислениеСсылка.ПредназначенияЭлементовСтруктурыОтчета");
		ВидСубконто = ПВХКорп.ПолучитьПоОписаниюТипов(ОТ);
		Если ВидСубконто = неопределено Тогда
			ВидСубконто = СоздатьПВХКорпПоОписаниюТипов(ОТ, НСтр("ru = 'Виды бюджетов'"));
		КонецЕсли;
		
		Возврат ВидСубконто;
	ИначеЕсли Аналитика = Аналитики.ДоговорКонтрагента Тогда
		Возврат ПВХКорп.СправочникДоговораКонтрагентов;
	ИначеЕсли Аналитика = Аналитики.ДокументПланирования Тогда
		
		ОТ = Новый ОписаниеТипов("ДокументСсылка.ОперативныйПлан");
		ВидСубконто = ПВХКорп.ПолучитьПоОписаниюТипов(ОТ);
		Если ВидСубконто = неопределено Тогда
			ВидСубконто = СоздатьПВХКорпПоОписаниюТипов(ОТ, НСтр("ru = 'Документы планирования'"));
		КонецЕсли;
		
		Возврат ВидСубконто;
	ИначеЕсли Аналитика = Аналитики.Контрагент Тогда
		
		ОТ = Новый ОписаниеТипов("СправочникСсылка.Контрагенты,СправочникСсылка.ФизическиеЛица");
		ВидСубконто = ПВХКорп.ПолучитьПоОписаниюТипов(ОТ);
		Если ВидСубконто = неопределено Тогда
			ВидСубконто = СоздатьПВХКорпПоОписаниюТипов(ОТ, НСтр("ru = 'Контрагенты и Физ.лица'"));
		КонецЕсли;
		
		Возврат ВидСубконто;
	ИначеЕсли Аналитика = Аналитики.Менеджер Тогда
		
		ОТ = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		ВидСубконто = ПВХКорп.ПолучитьПоОписаниюТипов(ОТ);
		Если ВидСубконто = неопределено Тогда
			ВидСубконто = СоздатьПВХКорпПоОписаниюТипов(ОТ, НСтр("ru = 'Физические лица'"));
		КонецЕсли;
		
		Возврат ВидСубконто;
	ИначеЕсли Аналитика = Аналитики.МестоПоставки Тогда
		Возврат ПВХКорп.МестаПоставки;
	ИначеЕсли Аналитика = Аналитики.ПриходРасход Тогда
		Возврат ПВХКорп.ПриходРасход;
	ИначеЕсли Аналитика = Аналитики.Номенклатура Тогда
		Возврат ПВХКорп.НоменклатураТоварныеГруппы;
	ИначеЕсли Аналитика = Аналитики.Организация Тогда
		Возврат ПВХКорп.ОрганизационныеЕдиницы;
	ИначеЕсли Аналитика = Аналитики.Период Тогда
		Возврат ПВХКорп.ПериодыОтчетов;
	ИначеЕсли Аналитика = Аналитики.Приоритет Тогда
		
		ОТ = Новый ОписаниеТипов("СправочникСсылка.ПриоритетыПотребностей");
		ВидСубконто = ПВХКорп.ПолучитьПоОписаниюТипов(ОТ);
		Если ВидСубконто = неопределено Тогда
			ВидСубконто = СоздатьПВХКорпПоОписаниюТипов(ОТ, НСтр("ru = 'Приоритеты потребностей'"));
		КонецЕсли;
		
		Возврат ВидСубконто;
	ИначеЕсли Аналитика = Аналитики.Проект Тогда
		Возврат ПВХКорп.Проекты;
	ИначеЕсли Аналитика = Аналитики.СтатьяБюджета Тогда
		Возврат ПВХКорп.СтатьиБюджетов;
	ИначеЕсли Аналитика = Аналитики.ЦФО Тогда
		Возврат ПВХКорп.СправочникЦФО;
	Иначе
		Возврат неопределено;
	КонецЕсли;
	
КонецФункции

Функция СоздатьПВХКорпПоОписаниюТипов(ОТ, Имя)
	
	Объект = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СоздатьЭлемент();
	Объект.ТипЗначения = ОТ;
	Объект.Наименование = Имя;
	Объект.УстановитьНовыйКод("УХ");
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти 

#Область ЗаполнитьСтруктуруОперативногоПланированияПоУмолчанию
	
Процедура ДобавитьВСтруктуруАналитику(НаборЗаписей, Аналитика, ОбязательноеЗаполнение, КонтрольЛимитов)
	
	Запись = НаборЗаписей.Добавить();
	Запись.Аналитика = Аналитика;
	Запись.ОбязательноеЗаполнение = ОбязательноеЗаполнение;
	Запись.КонтрольЛимитов = КонтрольЛимитов;
	
КонецПроцедуры

#КонецОбласти 

#Область РасширениеКоличестваНалитикСтатьиБюджетаДо6
	
Процедура ИнициализироватьАналитики456ОперПланирования()
	
	// Справочник.АналитикиОперативногоПланирования
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикиОперативногоПланирования.Ссылка КАК Ссылка,
	|	АналитикиОперативногоПланирования.ВозможноЛимитирование КАК ВозможноЛимитирование
	|ИЗ
	|	Справочник.АналитикиОперативногоПланирования КАК АналитикиОперативногоПланирования
	|ГДЕ
	|	АналитикиОперативногоПланирования.ВозможноЛимитирование = ЛОЖЬ
	|	И АналитикиОперативногоПланирования.Ссылка В (ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика4), ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика5), ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика6))";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбновитьСтруктуруОперативногоПланированияДо6АналитикСтатьи()
	
	// Обновить рс.СтруктураОперативногоПланирования
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыБюджетов.Ссылка КАК ВидБюджета
	|ПОМЕСТИТЬ ВТ_ВсеБюджеты
	|ИЗ
	|	ПланВидовХарактеристик.ВидыБюджетов КАК ВидыБюджетов
	|ГДЕ
	|	ВидыБюджетов.Предопределенный = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика1) КАК Аналитика
	|ПОМЕСТИТЬ ВТ_ВсеАналитики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика2)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика3)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика4)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика5)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика6)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеБюджеты.ВидБюджета КАК ВидБюджета,
	|	ВТ_ВсеАналитики.Аналитика КАК Аналитика
	|ПОМЕСТИТЬ ВТ_ВсеБюджетыАналитики
	|ИЗ
	|	ВТ_ВсеБюджеты КАК ВТ_ВсеБюджеты,
	|	ВТ_ВсеАналитики КАК ВТ_ВсеАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеБюджетыАналитики.ВидБюджета КАК ВидБюджета,
	|	ВТ_ВсеБюджетыАналитики.ВидБюджета.Предназначение КАК Предназначение,
	|	ВТ_ВсеБюджетыАналитики.Аналитика КАК Аналитика,
	|	ИСТИНА КАК ОбязательноеЗаполнение,
	|	ИСТИНА КАК КонтрольЛимитов
	|ИЗ
	|	ВТ_ВсеБюджетыАналитики КАК ВТ_ВсеБюджетыАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураОперативногоПланирования КАК СтруктураОперативногоПланирования
	|		ПО ВТ_ВсеБюджетыАналитики.ВидБюджета.Предназначение = СтруктураОперативногоПланирования.Предназначение
	|			И ВТ_ВсеБюджетыАналитики.Аналитика = СтруктураОперативногоПланирования.Аналитика
	|ГДЕ
	|	СтруктураОперативногоПланирования.Аналитика ЕСТЬ NULL
	|ИТОГИ ПО
	|	ВидБюджета";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаВидБюджета = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидБюджета.Следующий() Цикл
		
		нз = РегистрыСведений.СтруктураОперативногоПланирования.СоздатьНаборЗаписей();
		Отбор = НЗ.Отбор.Предназначение;
		Отбор.ВидСравнения = ВидСравнения.Равно;
		Отбор.Значение = ВыборкаВидБюджета.Предназначение;
		
		нз.Прочитать();
		
		Выборка = ВыборкаВидБюджета.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(нз.Добавить(), Выборка);
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НЗ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьАналитики456СтатьиВОперативныеПланы()
	
	// Обновить рс.СтруктураОперативногоПланирования
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика1) КАК Аналитика,
	|	1 КАК Номер
	|ПОМЕСТИТЬ ВТ_ВсеАналитики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика2),
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика3),
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика4),
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика5),
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.АналитикиОперативногоПланирования.Аналитика6),
	|	6
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыОперативныхПлановНастройкаАналитик.Ссылка КАК ВидОП,
	|	ВидыОперативныхПлановНастройкаАналитик.Аналитика КАК Аналитика,
	|	ВидыОперативныхПлановНастройкаАналитик.Использование КАК Использование,
	|	ВидыОперативныхПлановНастройкаАналитик.ЗначениеАналитики КАК ЗначениеАналитики,
	|	ВидыОперативныхПлановНастройкаАналитик.ГруппаСтрок КАК ГруппаСтрок,
	|	ВидыОперативныхПлановНастройкаАналитик.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
	|	ВидыОперативныхПлановНастройкаАналитик.КонтрольЛимитов КАК КонтрольЛимитов,
	|	ВидыОперативныхПлановНастройкаАналитик.ТипДанных КАК ТипДанных,
	|	ВТ_ВсеАналитики.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_АналитикиОП
	|ИЗ
	|	ВТ_ВсеАналитики КАК ВТ_ВсеАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОперативныхПланов.НастройкаАналитик КАК ВидыОперативныхПлановНастройкаАналитик
	|		ПО ВТ_ВсеАналитики.Аналитика = ВидыОперативныхПлановНастройкаАналитик.Аналитика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыОперативныхПлановНастройкаАналитик.Ссылка,
	|	ВидыОперативныхПлановНастройкаАналитик.Аналитика,
	|	ВидыОперативныхПлановНастройкаАналитик.Использование,
	|	ВидыОперативныхПлановНастройкаАналитик.ЗначениеАналитики,
	|	ВидыОперативныхПлановНастройкаАналитик.ГруппаСтрок,
	|	ВидыОперативныхПлановНастройкаАналитик.ОбязательноеЗаполнение,
	|	ИСТИНА,
	|	ВидыОперативныхПлановНастройкаАналитик.ТипДанных,
	|	ВТ_ВсеАналитики.Номер
	|ИЗ
	|	ВТ_ВсеАналитики КАК ВТ_ВсеАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперативныйПлан.НастройкаАналитик КАК ВидыОперативныхПлановНастройкаАналитик
	|		ПО ВТ_ВсеАналитики.Аналитика = ВидыОперативныхПлановНастройкаАналитик.Аналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикиОП.ВидОП КАК ВидОП,
	|	МАКСИМУМ(ВТ_АналитикиОП.Номер) КАК Номер
	|ПОМЕСТИТЬ ВТ_ПоследняяИспользуемаяАналитика
	|ИЗ
	|	ВТ_АналитикиОП КАК ВТ_АналитикиОП
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АналитикиОП.ВидОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикиОП.ВидОП КАК ВидОП,
	|	ВТ_АналитикиОП.Аналитика КАК Аналитика,
	|	ВТ_АналитикиОП.Использование КАК Использование,
	|	ВТ_АналитикиОП.ЗначениеАналитики КАК ЗначениеАналитики,
	|	ВТ_АналитикиОП.ГруппаСтрок КАК ГруппаСтрок,
	|	ВТ_АналитикиОП.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
	|	ВТ_АналитикиОП.КонтрольЛимитов КАК КонтрольЛимитов,
	|	ВТ_АналитикиОП.ТипДанных КАК ТипДанных,
	|	ВТ_АналитикиОП.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_ШаблонЗаполненияНовыхАналитик
	|ИЗ
	|	ВТ_ПоследняяИспользуемаяАналитика КАК ВТ_ПоследняяИспользуемаяАналитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АналитикиОП КАК ВТ_АналитикиОП
	|		ПО ВТ_ПоследняяИспользуемаяАналитика.ВидОП = ВТ_АналитикиОП.ВидОП
	|			И ВТ_ПоследняяИспользуемаяАналитика.Номер = ВТ_АналитикиОП.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_АналитикиОП.ВидОП КАК ВидОП,
	|	ВТ_ВсеАналитики.Аналитика КАК Аналитика
	|ПОМЕСТИТЬ ВТ_ВсеВидыОПАналитики
	|ИЗ
	|	ВТ_АналитикиОП КАК ВТ_АналитикиОП,
	|	ВТ_ВсеАналитики КАК ВТ_ВсеАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеВидыОПАналитики.ВидОП КАК Ссылка,
	|	ВТ_ВсеВидыОПАналитики.Аналитика КАК Аналитика,
	|	ВТ_ШаблонЗаполненияНовыхАналитик.Использование КАК Использование,
	|	ВТ_ШаблонЗаполненияНовыхАналитик.ЗначениеАналитики КАК ЗначениеАналитики,
	|	ВТ_ШаблонЗаполненияНовыхАналитик.ГруппаСтрок КАК ГруппаСтрок,
	|	ВТ_ШаблонЗаполненияНовыхАналитик.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
	|	ВТ_ШаблонЗаполненияНовыхАналитик.КонтрольЛимитов КАК КонтрольЛимитов,
	|	ВТ_ШаблонЗаполненияНовыхАналитик.ТипДанных КАК ТипДанных
	|ИЗ
	|	ВТ_ВсеВидыОПАналитики КАК ВТ_ВсеВидыОПАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналитикиОП КАК ВТ_АналитикиОП
	|		ПО ВТ_ВсеВидыОПАналитики.ВидОП = ВТ_АналитикиОП.ВидОП
	|			И ВТ_ВсеВидыОПАналитики.Аналитика = ВТ_АналитикиОП.Аналитика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШаблонЗаполненияНовыхАналитик КАК ВТ_ШаблонЗаполненияНовыхАналитик
	|		ПО ВТ_ВсеВидыОПАналитики.ВидОП = ВТ_ШаблонЗаполненияНовыхАналитик.ВидОП
	|ГДЕ
	|	ВТ_АналитикиОП.Аналитика ЕСТЬ NULL
	|ИТОГИ ПО
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСсылка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
		Объект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
		Выборка = ВыборкаСсылка.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект.НастройкаАналитик.Добавить(), Выборка);
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
